;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

(package! doom-modeline)
(package! ranger)
(package! kaolin-themes)
(package! racket-mode)
(package! org-wild-notifier)

(package! fountain-mode)
;; (package! write-or-die-mode :recipe
  ;; (:host github :repo "duncanmortimer/write-or-die-mode.el"))
(package! evil-collection)
(package! julia-repl)

(package! irony)
(package! irony-eldoc)
(package! ggtags)
(package! helm-gtags)

(package! lsp-haskell)
(package! lsp-ui)
(package! lsp-mode)

(package! poet-theme)


(package! gnus-desktop-notify)
(package! evil-org)
(package! toc-org)
(package! org-noter)
(package! org-bullets)
(package! org-super-agenda)
(package! org-brain)
(package! org-cliplink)
(package! helm-bibtex)
(package! org-babel-eval-in-repl)
(package! sly)

(package! yankpad)
(package! drag-stuff)
(package! mpdel)
(package! org-download)
(package! kaolin-themes)
(package! doom-themes)
(package! tao-theme)

(package! org-protocol-capture-html :recipe
  (:host github :repo "alphapapa/org-protocol-capture-html"))
(package! org-books :recipe (:host github :repo "lepisma/org-books"))
(package! org-board :recipe (:host github :repo "scallywag/org-board"))
(package! org-wiki :recipe (:host github :repo "caiorss/org-wiki"))
(package! org-ref :recipe (:host github :repo "jkitchin/org-ref"))
(package! zotxt-emacs :recipe (:host github :repo "egh/zotxt-emacs"))
(package! ob-rust :recipe (:host gitlab :repo "ajyoon/ob-rust"))
(package! org-writers-room :recipe (:host github :repo "titaniumbones/org-writers-room"))
(package! org-fs-tree :recipe (:host github "repo" "ScriptDevil/org-fs-tree"))

(package! engine-mode :recipe (:host github :repo "hrs/engine-mode"))
(package! yasnippet)
(package! yasnippet-snippets)

(package! rg)
(package! helm-rg)
(package! projectile-ripgrep)
(package! company)
(package! company-box)

(package! elpy)
(package! helm-org-rifle)
(package! helm-c-yasnippet)
